{"markdown": "### COMPANY NAME \nlululemon athletica\n\n### SYMBOL \nLULU\n\n### TITLE \nRiding Into Labor Day In Style With The Science of Feel\n\n### URL \nhttps://tdcowen.bluematrix.com/links2/doc/pdf/651868e1-1910-4116-bc21-4c6d6c4b0c4c\n\n### PUBLICATION DATE \nAugust 31, 2023\n\n### PRIMARY ANALYST NAME \nJohn Kernan, CFA\n\n### PRIMARY ANALYST PHONE \n646 562 1324\n\n### PRIMARY ANALYST EMAIL \njohn.kernan@cowen.com\n\n### ANALYST RATING \nOutperform\n\n### CURRENT PRICE DATE \n2023-08-31T00:00:00.00\n\n### CURRENT PRICE \n381.26\n\n### PREVIOUS PRICE TARGET \n$531.00\n\n### CURRENT PRICE TARGET \n$535.00\n\n### INSIGHT \nlululemon generated the highest gross margin in the history of the company and saw International and China grow +52% and 61%, respectively. N America accelerated through August, and we view 2H sales and EPS guidance as fairly conservative. Raising price target to $535, 36x FY24E EPS. Product pipeline and fabric innovation into year-end is robust across Men’s and Women’s.\n\n### KEY POINTS \nLULU reported better than expected Q2:23 with an +$0.18/share beat vs the midpoint of guidance. This result, which was driven by broad-based growth across categories (core, performance, OTM and new innovations), channels and regions and vs a sector backdrop awash with volatile Q2 results. Comps grew +11%, in line with Consensus but below our forecast of +15%Management confidently raised its FY23 EPS guidance by +$0.26/share at the midpoint, flowing through the entire Q2 beat while leaving room for further upside in 2H:23 given the consistent momentum in its business and very strong start to Q3:23, including in N. America. The Power of Feel x 2 strategy centered around innovation and expansion globally is driving this sales and margin momentum within a global opportunity that remains in early innings.Women's revenues grew +16% y/y, with Men's up +15%, and Accessories growing +44%. The latter included the belt bag, which grew +DD% in the quarter despite lapping its introduction to great response LY. By region, N. America revenues grew +11% y/y in Q2 (but accelerated through August) and International was up +52% y/y, including China up +61%.China continues to represent the largest area of new store growth within LULU's International store opening plans for FY23, as the region's profitability only modestly trails that of N. America, highlighting the long-term opportunity.We Remain Above Consensus Estimates Through FY24Management raised its FY23 revenue to $9.51B-$9.57B, an increase of +$95MM at the midpoint vs its +$54MM beat at the midpoint in Q2. Gross margin expansion is now expected to be +190bps-210bps as LULU recovers from the lack of air freight usage y/y, markdowns remain in line with LY, and inventory levels continue to moderate sequentially.Balanced with planned SG&A investments across the enterprise, including high return marketing activations, FY23 EBIT margin is guided to expand +40bps-60bps, leading to FY23 EPS guidance increasing to $12.02-$12.17 vs Consensus $11.93.We are raising our FY23 EPS to $12.36 from $12.29 on +19% revenue growth, including total comps up +14% and DTC up 17%, with EBIT margin expanding +95bps to 23% on Gross Margin rising +226bps, mostly on product margin gains from lower freight costs. Our FY24 EPS moves to $14.83, remaining above $13.73 Consensus. We assume low-double-digit sales growth and EBIT margin +60bps in FY24.\n\n### COWEN INVESTMENT THESIS \nWe have confidence that new product, integrated marketing, and online momentum combined with loyalty, a healthy high-end customer demographic, and athleisure fashion trends will yield traffic, improving conversion, and comps. Our survey indicates a high degree of loyalty and conversion levels should increase as we expect new product to incorporate fashionable versatility. We see long-term EPS potential of $22+ on LDD+ revenue CAGR, EBIT margin expansion to 24.7%, and a high-teens EPS CAGR through FY27E.\n\n### COWEN FORTHCOMING CATALYSTS \nQ3:23 earnings in Nov. 2023\n\n### COWEN BASE CASE ASSUMPTIONS \n+12% sales growth in FY24EFY24E EBIT margin of 23.6%, driven by gross margin expansion and SG&A deleverageFY24E EPS of $14.83PT = $535, 36x FY24E EPS\n\n### COWEN UPSIDE SCENARIO \nGrowth in men's accelerates and the male customer demographic reaches higher loyalty levels, while core women's continues at a double-digit pace; loyalty accelerates DTC growth to double-digit growth43x FY24E EPS of $16.35 = $703\n\n### COWEN DOWNSIDE SCENARIO \nE-com and gross margin contractThe brand fails to translate in Europe and Asia, resulting in strategic working of international strategy while the mix shift to lower margin international stores pressure EBIT margin22x FY24E EPS of $12.83 = $282\n\n### COWEN COMPANY DESCRIPTION \nlululemon athletica inc. designs and retails premium athletic apparel and accessories for yoga, running, and training. The brand mainly sells women’s wear, though it also supports a men’s business that is growing. Lululemon leverages a vertical retail and digital strategy to design and sell its products, and it has developed several trademarked fabrics. Based in Vancouver, Canada, the company operated 655 lululemon banner stores globally in FY22 and had global sales of $8.1B. Lululemon has inspired a devoted customer following through its community-based marketing and events, strong corporate culture, and unique in-store experience.\n\n### GENERAL RESEARCH \nThe LULU Innovation Pipeline Flywheel EffectInsight into LULU's 2H:23 product pipeline is in keeping with its \"Science of Feel\" focus on materials innovation. LULU reported seeing strong consumer response to its late Q2 to early Q3 product launches, especially across men's with Steady State and soft jersey collections being met with very strong consumer response as it expands the lounge and On the Move categories. Women's will launch a new collection in fall 2023 to met unmet needs, and in Q4 will see a new fabrication for cold weather runs and further expansion within Outerwear. Innovation is key part of what drives LULU's loyalty among existing customers and attracts new customers to the brand, creating a very profitable flywheel effect. LULU's membership programs, launched less than a year ago, have already reached 12MM guests in N. America, far exceeding the company's initial expectations.Price Target Increasing To $535, which represents 36x our FY24E EPS, and 23.4x EV/ EBITDA with sector leading ROIC of 48%.Broad-Based Growth Across The EnterpriseThis above-average growth is despite unaided awareness being in just the single digits in most markets outside of N. America where its 25%. By channel, store comps grew +7% and DTC (e-com) grew +15%, representing a deceleration from Q1:23 but outpacing much of the sector in Q2 and speaks to the relevancy of its assortment and engagement with its marketing activations that are driving traffic to both channels and leading to growth in conversion. Further marketing investments are planned for 2H:23, with strong initial reaction in Q3 QTD with campus campaigning and for the fall assortment, while marketing spend as a % of revenues should be relatively stable y/y in FY23.Key Q2 Highlights: (1) LULU reported Q2:23 EPS of $2.68, beating our estimate of $2.64, Consensus of $2.54 and management's guidance for $2.47-$2.52. The quarter was mostly in line with our above Consensus estimates, with SG&A and Other Income coming in better than our forecast, partially offset by slightly higher COGS. (2) Q2 sales grew +18% y/y, in line with our estimate but above Consensus +16%. Comps grew +11%, in line with Consensus but below our forecast of +15%. (3) Gross Margin expanded +230bps y/y to 58.8%, the highest quarterly GM in LULU's history. Drivers included +330bps from product margin, mostly from lower freight expense, partially offset by -70bps of buying and occupancy deleverage and -30bps from FX. (4) LULU achieved further sequential improvement in its inventory positioning, growing +14% y/y which was better than plan for up +20% and represented moderation from +24% growth in Q1:23. (5) Management initiated Q3:23 guidance for sales growth of +17%-18% y/y to $2.165B-$2.19B, above Consensus of $2.149B, and Q3 EPS of $2.23-$2.28 vs Consensus of $2.23. We are moving our Q3 EPS to $2.29 from $2.30 on revenue growth of +18%, including total comps of +13% and DTC +16%. Given the ongoing level of investments to support growth initiatives, including planned marketing activations, SG&A deleverage (we estimate 200bps) could offset gross margin expansion we are modeling of 190bps, leading to a flattish EBIT margin in Q3 before resuming expansion by Q4.\n\n### COWEN RISKS TO PRICE TARGET \nFashion and competitive risks may cause consumers to shift demand to LULU's competitors. A lower level of participation and frequency of exercise, especially in yoga, may reduce demand for the company's products. Quality control and sourcing issues may hinder the company's ability to stock stores with its products. International expansion may be slower, and may face more significant hurdles, than the company and investors may anticipate. LULU enjoys a large addressable market, with significant growth opportunities in both domestic and international store growth, non-yoga apparel, and men's. The sales benefit from these opportunities could be greater in magnitude and sooner than we expect.", "url": "https://tdcowen.bluematrix.com/links2/doc/pdf/651868e1-1910-4116-bc21-4c6d6c4b0c4c", "title": "LULU--August_2023_31--Riding Into Labor Day In Style With The Science of Feel", "metadata_storage_name": "LULU_August-2023-31.json", "publication_date": "2023-08-31", "markdown_components": ""}