{"markdown": "### COMPANY NAME \nlululemon athletica\n\n### SYMBOL \nLULU\n\n### TITLE \nlululemon Drops The Mic In Front Of The \"Macro\"\n\n### URL \nhttps://tdcowen.bluematrix.com/links2/doc/pdf/bff839d9-7164-4e90-94e6-81c56533524f\n\n### PUBLICATION DATE \nJune 1, 2023\n\n### PRIMARY ANALYST NAME \nJohn Kernan, CFA\n\n### PRIMARY ANALYST PHONE \n646 562 1324\n\n### PRIMARY ANALYST EMAIL \njohn.kernan@cowen.com\n\n### ANALYST RATING \nOutperform\n\n### CURRENT PRICE DATE \n2023-06-01T00:00:00.00\n\n### CURRENT PRICE \n328.35\n\n### PREVIOUS PRICE TARGET \n$525.00\n\n### CURRENT PRICE TARGET \n$531.00\n\n### INSIGHT \nChina +79% y/y, fuels International +60% y/y, with N. America +17% y/y. SSS +16% ex FX with brand activations and momentum into May likely supporting a conservative guide. China is scaling through local/grassroots approach. Our model suggests FY23 sales and EPS guidance is conservative as an expanding TAM and innovation across categories can produce upside. Raising price target to $531.\n\n### KEY POINTS \nQ1 Sales ahead of expectations, +24% y/y, was driven by accelerating trends in China, +79% y/y. Traffic across channels was robust, with store traffic up +30% y/y. Q1:23 gross margin expansion of +360bps y/y, with product margin up +430bps y/y, indicates that LULU successfully recaptured the bulk of its freight headwinds from Q1:22 and, in our view, should further alleviate concerns regarding promotional cadence. Q1 EPS of $2.28 was well ahead of our above-Consensus estimate of $2.00.Product margin expansion is expected to moderate through FY23, but remain positive, as air freight is now expected to be a +190bps contributor to FY23 gross margin expansion of +180bps-200bps y/y.Stores Continue to Be A Hub For Guest Retention And AcquisitionLULU's stores continue to be a key catalyst for customer retention and acquisition, and serve as focal points for community gatherings, product launches and connectivity/loyalty that are key to the retailer's community-based customer engagement model. Management noted that May's activations were particularly productive, as the Dupe Swap in LA event saw 50% of its attendees being new to the brand and 50% under the age of 30.Q2:23 sales guidance of $2.14B-$2.17B and EPS guide of $2.47-$2.52 both bracketed Consensus of $2.158B and $2.50, respectively. Q2 sales guidance assumes material deceleration, likely conservative given that LULU's inbound digital data remains near the top of our coverage and the continued China reopening should continue to be a top-line upside driver.FY23 raised EPS guidance of $11.74-$11.94 implies ~75% of the Q1 beat flowed through to guidance, as Q1 EPS was $0.32 ahead of guidance at the midpoint, while the FY23 guide was raised by +$0.23. Although Q4:23 GM is expected to have the most modest freight tailwinds (with freight costs finishing FY23 50bps above 2019), supply chain enhancements from the past few quarters could start to be a tailwind.Raising Our EstimatesOur Q2 EPS of $2.59 is above guidance of $2.47-$2.52 and Consensus of $2.50, while our FY23 EPS of $12.27 is above the high-end of guidance and Consensus of $11.61. Consensus is likely underestimating Q4 gross margin expansion and international sales growth. Our FY24 EPS estimate of $14.74 is above current consensus of $13.46.Our Price Target of $531 is 36x FY24E EPS of $14.74 and 23x EV/EBITDA with sector leading ROIC of 49%.\n\n### COWEN INVESTMENT THESIS \nWe have confidence that new product, integrated marketing, and online momentum combined with loyalty, a healthy high-end customer demographic, and athleisure fashion trends will yield traffic, improving conversion, and comps. Our survey indicates a high degree of loyalty and conversion levels should increase as we expect new product to incorporate fashionable versatility. We see long-term EPS potential of $22+ on mid-teens revenue CAGR, EBIT margin expansion to 24.5%, and a high-teens EPS CAGR through FY27E.\n\n### COWEN FORTHCOMING CATALYSTS \nQ2:23 earnings early Sept. 2023\n\n### COWEN BASE CASE ASSUMPTIONS \n+18% sales growth in FY23E, after 30% sales growth in FY22FY24E EBIT margin of 23.6%, driven by gross margin expansion and SG&A deleverageFY24E EPS of $14.74PT = $531, 36x FY24E EPS\n\n### COWEN UPSIDE SCENARIO \nGrowth in men's accelerates and the male customer demographic reaches higher loyalty levels, while core women's continues at a double-digit pace; loyalty accelerates DTC growth to double-digit growth45x FY24E EPS of $16 = $675\n\n### COWEN DOWNSIDE SCENARIO \nE-com and gross margin contractThe brand fails to translate in Europe and Asia, resulting in strategic working of international strategy while the mix shift to lower margin international stores pressure EBIT margin20x FY24E EPS of $12.50 = $250\n\n### COWEN COMPANY DESCRIPTION \nlululemon athletica inc. designs and retails premium athletic apparel and accessories for yoga, running, and training. The brand mainly sells women’s wear, though it also supports a men’s business that is growing. Lululemon leverages a vertical retail and digital strategy to design and sell its products, and it has developed several trademarked fabrics. Based in Vancouver, Canada, the company operated 655 lululemon banner stores globally in FY22 and had global sales of $8.1B. Lululemon has inspired a devoted customer following through its community-based marketing and events, strong corporate culture, and unique in-store experience.\n\n### GENERAL RESEARCH \nStore Productivity Reaches All-Time HighQ1:23 sales per sqft. was $1,535, a record for the quarter and +6% y/y. This suggests that LULU's new store productivity remains high and its China store openings are accretive to productivity metrics.Top-Line Growth Is Broad-BasedLULU's China business grew +79% y/y in Q1 and was the headline sales figure, which we estimate contributed ~500bps to the company's +24% Q1 sales growth. Growth was broad-based across regions in Q1, with North America up +17% y/y and International ex-China up and estimated +40%-45%. Management's visits to China confirm the brand's authentic position, with a new experiential store (3 stories with a studio inside) in Shanghai serving as a springboard to serving consumers wanting to experience the sweat life. All ambassadors are local.Women's sales growth of +22% y/y slightly outpaced Men's, which was up +17% y/y. Q1 Comps ex-FX were up +17%, which was driven evenly by stores up +16% and e-commerce up +18%. Both core franchises and new styles continue to perform well, with Women's Bottoms, Lululemon's most developed category, up +22% y/y in Q1.Loyalty Program Continues To ExpandLululemon also went live with its paid Studio app in May which, as a reminder, is an extension of its MIRROR content without the associated hardware. Management believes that this program will expand the companies TAM, give it a recurring, subscription-based revenue stream and provide it with more data regarding how its guests engage with the brand. LULU isn't providing quarterly membership numbers for its Essentials program, but noted that after six months the program had over 8MM members.Q2 Highlights: 1) Q1 sales growth of +24% y/y was broad-based, with International up +60% y/y and China up +79% y/y. Q1 China growth represents a significant acceleration from the ~ +30% growth LULU reported seeing in the region in Q4:22. 2) FY23 EPS guidance was raised by +$0.23 at the midpoint to $11.74-$11.94, which we think is conservative as it implies significantly decelerating sales trends and moderating gross margin expansion. 3) Q2 EPS guidance was issued at $2.47-$2.52, which was in line with Consensus at the midpoint and below our revised Q2 EPS estimate of $2.59. 4) FY23 Gross margin is expected to expand +180bps-200bps y/y, with the guidance for freight benefits now expected to be +190bps, revised upward from the prior guidance of +150bps. 5) Q1 inventory grew +24% y/y, in line with sales, and is expected to moderate to +20% y/y in Q2.\n\n### COWEN RISKS TO PRICE TARGET \nFashion and competitive risks may cause consumers to shift demand to LULU's competitors. A lower level of participation and frequency of exercise, especially in yoga, may reduce demand for the company's products. Quality control and sourcing issues may hinder the company's ability to stock stores with its products. International expansion may be slower, and may face more significant hurdles, than the company and investors may anticipate. LULU enjoys a large addressable market, with significant growth opportunities in both domestic and international store growth, non-yoga apparel, and men's. The sales benefit from these opportunities could be greater in magnitude and sooner than we expect.", "url": "https://tdcowen.bluematrix.com/links2/doc/pdf/bff839d9-7164-4e90-94e6-81c56533524f", "title": "LULU--June_2023_01--lululemon Drops The Mic In Front Of The \"Macro\"", "metadata_storage_name": "LULU_June-2023-01.json", "publication_date": "2023-06-01", "markdown_components": ""}