{"markdown": "### COMPANY NAME \nlululemon athletica\n\n### SYMBOL \nLULU\n\n### TITLE \nDeep Dive Into Key Themes - Science Of Feel, International, China\n\n### URL \nhttps://tdcowen.bluematrix.com/links2/doc/pdf/f6a19eb1-cc54-4709-bb34-0fcb41d764f7\n\n### PUBLICATION DATE \nAugust 22, 2023\n\n### PRIMARY ANALYST NAME \nJohn Kernan, CFA\n\n### PRIMARY ANALYST PHONE \n646 562 1324\n\n### PRIMARY ANALYST EMAIL \njohn.kernan@cowen.com\n\n### ANALYST RATING \nOutperform\n\n### CURRENT PRICE DATE \n2023-08-22T00:00:00.00\n\n### CURRENT PRICE \n379.42\n\n### PREVIOUS PRICE TARGET \n\n\n### CURRENT PRICE TARGET \n$531.00\n\n### INSIGHT \nIn what has been a challenging Q2 season for the sector - lululemon stands out on an idiosyncratic level. We see management having room to raise FY EPS guidance range by +$0.10 to $0.12 with room to express confidence in near- and long-term targets both in N. America and International. Reiterate $531 price target, which is 36x our above Consensus FY24E EPS estimates.\n\n### KEY POINTS \nDatapoints Support Topline UpsideIntra-quarter data points continue to depict brand momentum, supporting management’s guidance for +15%-16% y/y Q2:23 sales growth at the minimum, and our estimate of +18% vs. Consensus of +16%. Recall that LULU grew sales +24% y/y in Q1:23, above guidance for +17%-20%.Similarweb digital visitor traffic on a trailing three-month y/y basis in Q2:23 rose +29% y/y in July, +30% in June, and +27% in May. In our June Athlete Beat report (Link), our proprietary work on top sellers indicated that pricing was stable within LULU’s top-selling SKUs (Align franchise and Everywhere Belt Bag).We See Upside To EstimatesWe model Q2 SSS +15.4% with Corporate Stores SSS +15% and DTC +16%. LULU is guiding to Q2 Gross margin expansion of +200bps-220bps (note gross margin increased 357bps in Q1), mostly driven by reduction in air freight (the freight headwind in Q2 LY is only 150bps vs 350bps+ in Q1 LY). Top seller ASPs support the notion of a continued healthy mark-on position within its merchandise margin.We’re modeling Q2:23 gross margin up +225bps y/y to 58.7%, with +240bps of product margin expansion, largely from lower freight costs, marginally offset by reinvestment in product, supply chain, and FX. This is slightly above the high end of management’s guidance and Consensus of +200bps. Q2 EPS of $2.64 compares to Consensus of $2.54, which is above the high end of management’s guidance for $2.47-$2.52.Our above-guidance sales estimate, +18% (vs guidance of 17% at midpoint), and gross margin estimates are driving our FY23 EPS estimate of $12.29, +3.5% above the management's guidance for $11.74-$11.94 and above Consensus of $11.93. We see potential for freight tailwinds to drive FY23 gross margin of 58.4%, +220bps y/y. We can see management flowing through the $0.12 of EPS upside to FY guidance. Our FY23 EPS estimate sits at $12.29 vs consensus of $11.93. We detail our International and N. America estimates inside.We’re modeling Lululemon’s store productivity, as measured by both sales per store and sales per square foot, to reach all-time highs in FY23 as Lululemon’s international business scales. We model China +59% to $1B and Int'l to reach 19% of revenue.Inside we include our Q2 Dashboard, which summarizes our estimates relative to Consensus, areas that are underappreciated. The implied volatility for LULU is ~7% into Q2.\n\n### COWEN INVESTMENT THESIS \nWe have confidence that new product, integrated marketing, and online momentum combined with loyalty, a healthy high-end customer demographic, and athleisure fashion trends will yield traffic, improving conversion, and comps. Our survey indicates a high degree of loyalty and conversion levels should increase as we expect new product to incorporate fashionable versatility. We see long-term EPS potential of $22+ on mid-teens revenue CAGR, EBIT margin expansion to 24.5%, and a high-teens EPS CAGR through FY27E.\n\n### COWEN FORTHCOMING CATALYSTS \nQ2:23 earnings on 8/31/23\n\n### COWEN BASE CASE ASSUMPTIONS \n+18% sales growth in FY23E, after 30% sales growth in FY22FY24E EBIT margin of 23.5%, driven by gross margin expansion and SG&A deleverageFY24E EPS of $14.743PT = $531, 36x FY24E EPS\n\n### COWEN UPSIDE SCENARIO \nGrowth in men's accelerates and the male customer demographic reaches higher loyalty levels, while core women's continues at a double-digit pace; loyalty accelerates DTC growth to double-digit growth45x FY24E EPS of $16 = $675\n\n### COWEN DOWNSIDE SCENARIO \nE-com and gross margin contractThe brand fails to translate in Europe and Asia, resulting in strategic working of international strategy while the mix shift to lower margin international stores pressure EBIT margin22x FY24E EPS of $12.50 = $275\n\n### COWEN COMPANY DESCRIPTION \nlululemon athletica inc. designs and retails premium athletic apparel and accessories for yoga, running, and training. The brand mainly sells women’s wear, though it also supports a men’s business that is growing. Lululemon leverages a vertical retail and digital strategy to design and sell its products, and it has developed several trademarked fabrics. Based in Vancouver, Canada, the company operated 655 lululemon banner stores globally in FY22 and had global sales of $8.1B. Lululemon has inspired a devoted customer following through its community-based marketing and events, strong corporate culture, and unique in-store experience.\n\n### GENERAL RESEARCH \nScience Of Feel Platform Supports Path To FY26 Sales of $12.5B+We see LULU’s focus on innovation as a key tenet supporting our long-term top-line potential of $14B+ through FY27, representing a +12% CAGR from $9.6B in FY22, and beating its $12.5B sales target guided to for FY26 at the 2022 Analyst Day.\n\n### COWEN RISKS TO PRICE TARGET \nFashion and competitive risks may cause consumers to shift demand to LULU's competitors. A lower level of participation and frequency of exercise, especially in yoga, may reduce demand for the company's products. Quality control and sourcing issues may hinder the company's ability to stock stores with its products. International expansion may be slower, and may face more significant hurdles, than the company and investors may anticipate. LULU enjoys a large addressable market, with significant growth opportunities in both domestic and international store growth, non-yoga apparel, and men's. The sales benefit from these opportunities could be greater in magnitude and sooner than we expect.", "url": "https://tdcowen.bluematrix.com/links2/doc/pdf/f6a19eb1-cc54-4709-bb34-0fcb41d764f7", "title": "LULU--August_2023_22--Deep Dive Into Key Themes - Science Of Feel, International, China", "metadata_storage_name": "LULU_August-2023-22.json", "publication_date": "2023-08-22", "markdown_components": ""}